In [ ]:
%load tutorial.db [rw]

In [ ]:
Create table If Not Exists Employeesss (employee_id int, name varchar(20), manager_id int, salary int)

In [ ]:
insert into Employeesss (employee_id, name, manager_id, salary) values ('3', 'Mila', '9', '60301')

In [ ]:
insert into Employeesss (employee_id, name, manager_id, salary) values ('12', 'Antonella', 'None', '31000')

In [ ]:
insert into Employeesss (employee_id, name, manager_id, salary) values ('13', 'Emery', 'None', '67084')

In [ ]:
insert into Employeesss (employee_id, name, manager_id, salary) values ('1', 'Kalel', '11', '21241')

In [ ]:
insert into Employeesss (employee_id, name, manager_id, salary) values ('9', 'Mikaela', 'None', '50937')

In [ ]:
insert into Employeesss (employee_id, name, manager_id, salary) values ('11', 'Joziah', '6', '28485')

In [ ]:
select * from employeesss

+-------------+-----------+------------+--------+
| employee_id | name      | manager_id | salary |
+-------------+-----------+------------+--------+
| 3           | Mila      | 9          | 60301  |
+-------------+-----------+------------+--------+
| 12          | Antonella | None       | 31000  |
+-------------+-----------+------------+--------+
| 13          | Emery     | None       | 67084  |
+-------------+-----------+------------+--------+
| 1           | Kalel     | 11         | 21241  |
+-------------+-----------+------------+--------+
| 9           | Mikaela   | None       | 50937  |
+-------------+-----------+------------+--------+
| 11          | Joziah    | 6          | 28485  |
+-------------+-----------+------------+--------+

## Find the IDs of the employees whose salary is strictly less than $30000 and whose manager left the company. When a manager leaves the company, their information is deleted from the Employees table, but the reports still have their manager_id set to the manager that left.

In [ ]:
select employee_id, manager_id from employeesss where salary<30000

+-------------+------------+
| employee_id | manager_id |
+-------------+------------+
| 1           | 11         |
+-------------+------------+
| 11          | 6          |
+-------------+------------+

In [ ]:
select employee_id from employeesss

+-------------+
| employee_id |
+-------------+
| 3           |
+-------------+
| 12          |
+-------------+
| 13          |
+-------------+
| 1           |
+-------------+
| 9           |
+-------------+
| 11          |
+-------------+

In [ ]:
select employee_id from employeesss where salary<30000 and manager_id not in (select employee_id from employeesss)

+-------------+
| employee_id |
+-------------+
| 11          |
+-------------+